blog/_posts/2013-10/2013-10-31-python-namespace-scope.html
---
layout: post
keywords: 
description: 
title: python命名空间和作用域 
categories: [python]
tags: [python,命名空间,作用域]
group: archive
icon: code
featured: false
---

<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 命名空间(namespace)</a></li>
<li><a href="#sec-2">2 赋值(assignment)</a></li>
<li><a href="#sec-3">3 作用域(scope)</a></li>
<li><a href="#sec-4">4 变量名解析：LEGB 原则</a>
<ul>
<li><a href="#sec-4-1">4.1 计数器例子</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">命名空间(namespace)</h2>
<div class="outline-text-2" id="text-1">

<p>A namespace is a mapping from names to objects
</p>
<p>
命名空间是名字和对象的映射。也就是可以把一个namespace理解为一个字典，实际上很多当前的Python实现namespace就是用的字典。各个命名空间是独立的，没有任何关系的，所以一个命名空间中不能有重名，但不同的命名空间是可以重名而没有任何影响。
</p>
<p>
那么哪些可以是一个namespace呢，比如Python的built-in names（包括内置函数，内置常量，内置类型）；一个模块的global names（这个模块定义的函数，类，变量）；一个函数的所有local names；还有一个类对象的所有属性（数据成员，成员函数）都组成一个命名空间。
</p>
<p>
命名空间都是有创建时间和生存期的。对于Python built-in names组成的命名空间，它在Python解释器启动的时候被创建，在解释器退出的时候才被删除；对于一个Python模块的global namespace，它在这个module被import的时候创建，在解释器退出的时候退出；对于一个函数的local namespace，它在函数每次被调用的时候创建 ，函数返回的时候被删除。
</p><dl>
<dt>总结</dt><dd>一个模块的引入，函数的调用，类的定义都会引入命名空间，函数中的再定义函数，类中的成员函数定义会在局部namespace中再次引入局部namespace。
</dd>
</dl>

</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">赋值(assignment)</h2>
<div class="outline-text-2" id="text-2">

<p>Assignments do not copy data — they just bind names to objects.
</p>
<p>
赋值操作不会拷贝，只是把名字和对象做一个绑定。也就是赋值语句是起一个绑定或重绑定的作用（bind or rebind）。函数调用的参数传递是赋值，不是拷贝。
</p></div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3">作用域(scope)</h2>
<div class="outline-text-2" id="text-3">

<p>A scope is a textual region of a Python program where a namespace is directly accessible.
</p>
<p>
作用域是Python程序（文本）的某一段或某些段，在这些地方，某个命名空间中的名字可以被直接引用(不用前缀)。这个作用域就是这个命名空间的作用域。
</p>
<p>
简而言之，就是Python在解析一个名称可以查找的文字范围。
</p>
<p>
一个Python程序的几个作用域(也就是后文中的LEGB)：
</p><ul>
<li>最里面的局部作用域
</li>
<li>外层函数的局部作用域
</li>
<li>模块的全局作用域
</li>
<li>包含Python内置对象的最外层作用域
</li>
</ul>

<p>在代码中变量名被赋值（Python 中变量声明即赋值，global 声明的只是变量的使用域）的位置决定了该变量能被访问的范围。函数定义了本地作用域，而模块定义的是全局作用域。这两个作用域之前有如下关系：
</p><dl>
<dt>每一个模块都是全局作用域</dt><dd>也就是说，创建于模块文件顶层的变量具有全局作用域，对于外部访问就成了一个模块对象的属性。
</dd>
<dt>全局作用域的作用范围仅限于单个文件</dt><dd>“全局”指的是在一个文件的顶层变量名对于这个文件而言是全局的。
</dd>
<dt>每次对函数的调用都创建了一个新的本地作用域。</dt><dd>Python 中也有递归，即可以调用自身，每次调用都会创建五个新的本地命名空间。
</dd>
<dt>赋值的变量名除非声明为全局变量，否则均为本地变量。</dt><dd>如果需要在函数内部对模块文件顶层的变量名赋值，需要在函数内部通过 global 语句声明该变量。
</dd>
<dt>所有的变量可归纳为本地、全局或者内置三种。</dt><dd>范围分别为 def 内部，在一个模块的命名空间内部和预定义的 _<sub>builtin</sub>__ 模块提供的变量。
</dd>
</dl>

</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4">变量名解析：LEGB 原则</h2>
<div class="outline-text-2" id="text-4">

<p>Python 的变量名解析机制也称为 LEGB 法则.当一个变量被访问的时候，Python会按LEGB的顺序来搜索变量： <br/>
要说明的是，这里的访问规则只对普通变量有效，对象属性的规则与这无关（简单地说，访问一个对象的属性与此无关）.
</p><ul>
<li>L. Local. 局部作用域，即函数中定义的变量（没有用global声明）
</li>
<li>E. Enclosing. 嵌套的父级函数的局部作用域，即包含此函数的上级函数的局部作用域，通常也叫non-local作用域。
</li>
<li>G. Global(module). 在模块级别定义的全局变量（如果需要在函数内修改它，需要用global声明）
</li>
<li>B. Built-in. built-in模块里面的变量，比如int, Exception等等
</li>
</ul>

<p>按这个查找原则，在第一处找到的地方停止。如果没有找到，Python 会报错的。
</p>
<p>
下面以计数器的例子作说明
</p>


<pre class="src src-python"><span style="color: #2e8b57;">value</span> = 1
<span style="color: #1c86ee;">def</span> <span style="color: #cd9b1d;">fun</span>():
    <span style="color: #2e8b57;">value</span> = value + 1
    <span style="color: #1c86ee;">print</span> value
fun()
Traceback (most recent call last):
  File <span style="color: #8b7355;">"&lt;stdin&gt;"</span>, line 1, <span style="color: #1c86ee;">in</span> &lt;module&gt;
  File <span style="color: #8b7355;">"&lt;stdin&gt;"</span>, line 2, <span style="color: #1c86ee;">in</span> fun
<span style="color: #00688b;">UnboundLocalError</span>: local variable <span style="color: #8b7355;">'value'</span> referenced before assignment
</pre>

<p>
首先通过赋值在全局命名空间中创建了变量value。也许你会认为，当函数fun()内部value加1是会先在局部的命名空间中查找变量，无法找到时在全局命名空间中找到该名字。事实并非如此。
</p>
<p>
python提出如下假设，如果在函数体内的任何地方对变量赋值，则python将名称添加到局部命名空间中。语句value=value+1对对象value进行赋值。python假设无论在何处发生赋值，value都是函数fun局部命名空间的一部分。当python尝试把1跟value相加时，该value名称在局部命名空间中，但它没有关联值，所以python报错。
</p>
<p>
问题在于python何时决定使value出现在局部命名空间中。实际value出现在局部命名空间中发生在代码运行前，即，在python运行到函数定义之前。由于创建命名空间时，python会检查代码并填充局部命名空间。在python运行那行代码之前，就发现了对value的赋值，并把它添加到局部命名空间中，当函数执行时，python解释器认为value在局部命名空间中但没有值，所以会产生错误。
</p>
<p>
有一个方法可以解决上面的问题。如果在函数体内，使用global语句将变量声明为全局变量，那么python不会为该变量在命名空间中创建局部名称。
</p>


<pre class="src src-python"><span style="color: #2e8b57;">value</span> = 1
<span style="color: #1c86ee;">def</span> <span style="color: #cd9b1d;">fun</span>():
    <span style="color: #1c86ee;">global</span> value
    <span style="color: #2e8b57;">value</span> = value + 1
    <span style="color: #1c86ee;">print</span> value
fun()
2
</pre>


</div>

<div id="outline-container-4-1" class="outline-3">
<h3 id="sec-4-1">计数器例子</h3>
<div class="outline-text-3" id="text-4-1">




<pre class="src src-python"><span style="color: #1c86ee;">def</span> <span style="color: #cd9b1d;">create_counter</span>(initval):
    <span style="color: #2e8b57;">val</span> = initval
    <span style="color: #1c86ee;">def</span> <span style="color: #cd9b1d;">_inner_counter</span>():
        <span style="color: #2e8b57;">val</span> = val + 1
        <span style="color: #1c86ee;">return</span> val
    <span style="color: #1c86ee;">return</span> _inner_counter

<span style="color: #2e8b57;">counter</span> = create_counter(0)
<span style="color: #1c86ee;">print</span> <span style="color: #8b7355;">"First invocation: "</span>, counter()
</pre>

<p>
用Python 2.7运行发现不行,有如下报错:
</p>


<pre class="src src-sh">First invocation:
<span style="color: #cd9b1d;">Traceback</span> (most recent call last):
  File <span style="color: #8b7355;">"&lt;stdin&gt;"</span>, line 1,<span style="color: #1c86ee;"> in</span> &lt;module&gt;
  File <span style="color: #8b7355;">"&lt;stdin&gt;"</span>, line 4,<span style="color: #1c86ee;"> in</span> _inner_counter
UnboundLocalError: local variable <span style="color: #8b7355;">'val'</span> referenced before assignment
</pre>

<p>
先看下面的例子
</p>


<pre class="src src-python"><span style="color: #1c86ee;">def</span> <span style="color: #cd9b1d;">outer_func</span>():
    <span style="color: #2e8b57;">x</span> = 3
    <span style="color: #1c86ee;">def</span> <span style="color: #cd9b1d;">inner_func1</span>():
        <span style="color: #1c86ee;">print</span> <span style="color: #8b7355;">"inner func 1:"</span>, x
    <span style="color: #1c86ee;">def</span> <span style="color: #cd9b1d;">inner_func2</span>():
        <span style="color: #2e8b57;">x</span> = <span style="color: #8b7355;">"hello"</span>
        <span style="color: #1c86ee;">print</span> <span style="color: #8b7355;">"inner func 2:"</span>, x
    inner_func1()
    inner_func2()
    <span style="color: #1c86ee;">print</span> <span style="color: #8b7355;">"outer func"</span>, x
outer_func()
inner func 1: 3
inner func 2: hello
outer func 3
</pre>

<p>
按照LEGB原则，执行inner<sub>func1</sub>()时，Python在函数内局部作用域找不到x，会在父级作用域中搜寻x，结果在outer<sub>func的局部作用域中发现了它，</sub> 所以inner<sub>func1会打印3。inner</sub><sub>func2中试图对x绑定新的值，Python解释器认为这是在创建一个新的局部变量x，其值为’hello’，</sub> 于是inner<sub>func2会打印出’hello’，</sub> 但这对outer<sub>func中的x无影响（因为在不同的作用域里），所以最后outer</sub><sub>func中打印的还是3。</sub>
</p>
<p>
这也解释了为什么计数器的例子无法在Python上运行了：<sub>inner</sub><sub>counter里的var</sub> = var + 1让Python认为var是一个局部变量， 而非外层函数中的var，而这条赋值语句还试图读取var的旧值，所以会报‘赋值之前引用’的错误
</p>
<p>
如果确实要在一个函数里修改全局变量，Python提供了global关键字来声明一个变量是全局变量，声明以后就可以修改其值了。 然而global只能用来修改全局作用域里的变量，对于嵌套函数的情况无能为力，所以计数器的例子在Python 2.x中是无法实现的。 然而在Python 3中，一个新的关键字nonlocal的产生解决了这个问题。我们可以用Python 3来改写第一个例子：
</p>


<pre class="src src-python"><span style="color: #1c86ee;">def</span> <span style="color: #cd9b1d;">create_counter</span>(initval):
    <span style="color: #2e8b57;">val</span> = initval
    <span style="color: #1c86ee;">def</span> <span style="color: #cd9b1d;">_inner_counter</span>():
        <span style="color: #1c86ee;">nonlocal</span> val
        <span style="color: #2e8b57;">val</span> = val + 1
        <span style="color: #1c86ee;">return</span> val
    <span style="color: #1c86ee;">return</span> _inner_counter

<span style="color: #1c86ee;">if</span> <span style="color: #cd6600;">__name__</span> == <span style="color: #8b7355;">'__main__'</span>:
    counter = create_counter(10)
    <span style="color: #1c86ee;">print</span>(<span style="color: #8b7355;">"First invocation: "</span>, counter())
    <span style="color: #1c86ee;">print</span>(<span style="color: #8b7355;">"Second invocation: "</span>, counter())
    <span style="color: #1c86ee;">print</span>(<span style="color: #8b7355;">"Third invocation: "</span>, counter())
</pre>

<p>
运行结果
</p>


<pre class="src src-sh">python3.2 counter.py                                                                                                                [git:master]
First invocation:  11
Second invocation:  12
Third invocation:  13
</pre>

</div>
</div>
</div>
